12/data/attachments/dea4b31d49692929.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:username>
            <nif:friendToBeAdded>Steven_unit_Friend_64760_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>